zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_64_qfn.h
/* PORT 4 (GPIO) */
#define P4_0_PORT                       GPIO_PRT4
#define P4_0_PIN                        0u
#define P4_0_NUM                        0u
#define P4_0_AMUXSEGMENT                AMUXBUS_MSC
#define P4_1_PORT                       GPIO_PRT4
#define P4_1_PIN                        1u
#define P4_1_NUM                        1u
#define P4_1_AMUXSEGMENT                AMUXBUS_MSC
#define P4_2_PORT                       GPIO_PRT4
#define P4_2_PIN                        2u
#define P4_2_NUM                        2u
#define P4_2_AMUXSEGMENT                AMUXBUS_MSC
#define P4_3_PORT                       GPIO_PRT4
#define P4_3_PIN                        3u
#define P4_3_NUM                        3u
#define P4_3_AMUXSEGMENT                AMUXBUS_MSC
#define P4_4_PORT                       GPIO_PRT4
#define P4_4_PIN                        4u
#define P4_4_NUM                        4u
#define P4_4_AMUXSEGMENT                AMUXBUS_MSC
#define P4_5_PORT                       GPIO_PRT4
#define P4_5_PIN                        5u
#define P4_5_NUM                        5u
#define P4_5_AMUXSEGMENT                AMUXBUS_MSC
#define P4_6_PORT                       GPIO_PRT4
#define P4_6_PIN                        6u
#define P4_6_NUM                        6u
#define P4_6_AMUXSEGMENT                AMUXBUS_MSC
#define P4_7_PORT                       GPIO_PRT4
#define P4_7_PIN                        7u
#define P4_7_NUM                        7u
#define P4_7_AMUXSEGMENT                AMUXBUS_MSC

/* PORT 5 (GPIO) */
#define P5_0_PORT                       GPIO_PRT5
#define P5_0_PIN                        0u
#define P5_0_NUM                        0u
#define P5_0_AMUXSEGMENT                AMUXBUS_MSC
#define P5_1_PORT                       GPIO_PRT5
#define P5_1_PIN                        1u
#define P5_1_NUM                        1u
#define P5_1_AMUXSEGMENT                AMUXBUS_MSC
#define P5_2_PORT                       GPIO_PRT5
#define P5_2_PIN                        2u
#define P5_2_NUM                        2u
#define P5_2_AMUXSEGMENT                AMUXBUS_MSC
#define P5_3_PORT                       GPIO_PRT5
#define P5_3_PIN                        3u
#define P5_3_NUM                        3u
#define P5_3_AMUXSEGMENT                AMUXBUS_MSC
#define P5_4_PORT                       GPIO_PRT5
#define P5_4_PIN                        4u
#define P5_4_NUM                        4u
#define P5_4_AMUXSEGMENT                AMUXBUS_MSC
#define P5_5_PORT                       GPIO_PRT5
#define P5_5_PIN                        5u
#define P5_5_NUM                        5u
#define P5_5_AMUXSEGMENT                AMUXBUS_MSC
#define P5_6_PORT                       GPIO_PRT5
#define P5_6_PIN                        6u
#define P5_6_NUM                        6u
#define P5_6_AMUXSEGMENT                AMUXBUS_MSC
#define P5_7_PORT                       GPIO_PRT5
#define P5_7_PIN                        7u
#define P5_7_NUM                        7u
#define P5_7_AMUXSEGMENT                AMUXBUS_MSC

/* PORT 6 (GPIO) */
#define P6_0_PORT                       GPIO_PRT6
#define P6_0_PIN                        0u
#define P6_0_NUM                        0u
#define P6_0_AMUXSEGMENT                AMUXBUS_MSC
#define P6_1_PORT                       GPIO_PRT6
#define P6_1_PIN                        1u
#define P6_1_NUM                        1u
#define P6_1_AMUXSEGMENT                AMUXBUS_MSC
#define P6_2_PORT                       GPIO_PRT6
#define P6_2_PIN                        2u
#define P6_2_NUM                        2u
#define P6_2_AMUXSEGMENT                AMUXBUS_MSC
#define P6_3_PORT                       GPIO_PRT6
#define P6_3_PIN                        3u
#define P6_3_NUM                        3u
#define P6_3_AMUXSEGMENT                AMUXBUS_SYS
#define P6_4_PORT                       GPIO_PRT6
#define P6_4_PIN                        4u
#define P6_4_NUM                        4u
#define P6_4_AMUXSEGMENT                AMUXBUS_SYS
#define P6_5_PORT                       GPIO_PRT6
#define P6_5_PIN                        5u
#define P6_5_NUM                        5u
#define P6_5_AMUXSEGMENT                AMUXBUS_SYS
#define P6_6_PORT                       GPIO_PRT6
#define P6_6_PIN                        6u
#define P6_6_NUM                        6u
#define P6_6_AMUXSEGMENT                AMUXBUS_SYS

/* PORT 7 (GPIO) */
#define P7_0_PORT                       GPIO_PRT7
#define P7_0_PIN                        0u
#define P7_0_NUM                        0u
#define P7_0_AMUXSEGMENT                AMUXBUS_MSC
#define P7_1_PORT                       GPIO_PRT7
#define P7_1_PIN                        1u
#define P7_1_NUM                        1u
#define P7_1_AMUXSEGMENT                AMUXBUS_MSC

/* Analog Connections */
#define LPCOMP_IN_N0_PORT               1u
#define LPCOMP_IN_N0_PIN                2u
#define LPCOMP_IN_N1_PORT               1u
#define LPCOMP_IN_N1_PIN                4u
#define LPCOMP_IN_P0_PORT               1u
#define LPCOMP_IN_P0_PIN                1u
#define LPCOMP_IN_P1_PORT               1u
#define LPCOMP_IN_P1_PIN                3u
#define MSC0_CMOD1PADD_PORT             4u
#define MSC0_CMOD1PADD_PIN              0u
#define MSC0_CMOD1PADS_PORT             4u
#define MSC0_CMOD1PADS_PIN              0u
#define MSC0_CMOD2PADD_PORT             4u
#define MSC0_CMOD2PADD_PIN              1u
#define MSC0_CMOD2PADS_PORT             4u
#define MSC0_CMOD2PADS_PIN              1u
#define MSC0_CMOD3PADD_PORT             4u
#define MSC0_CMOD3PADD_PIN              2u
#define MSC0_CMOD3PADS_PORT             4u
#define MSC0_CMOD3PADS_PIN              2u
#define MSC0_CMOD4PADD_PORT             4u
#define MSC0_CMOD4PADD_PIN              3u
#define MSC0_CMOD4PADS_PORT             4u
#define MSC0_CMOD4PADS_PIN              3u
#define MSC0_S_PAD0_PORT                4u
#define MSC0_S_PAD0_PIN                 7u
#define MSC0_S_PAD1_PORT                4u
#define MSC0_S_PAD1_PIN                 6u
#define MSC0_S_PAD10_PORT               1u
#define MSC0_S_PAD10_PIN                4u
#define MSC0_S_PAD11_PORT               1u
#define MSC0_S_PAD11_PIN                5u
#define MSC0_S_PAD12_PORT               1u
#define MSC0_S_PAD12_PIN                6u
#define MSC0_S_PAD13_PORT               1u
#define MSC0_S_PAD13_PIN                7u
#define MSC0_S_PAD14_PORT               3u
#define MSC0_S_PAD14_PIN                0u
#define MSC0_S_PAD15_PORT               3u
#define MSC0_S_PAD15_PIN                1u
#define MSC0_S_PAD2_PORT                4u
#define MSC0_S_PAD2_PIN                 5u
#define MSC0_S_PAD3_PORT                4u
#define MSC0_S_PAD3_PIN                 4u
#define MSC0_S_PAD4_PORT                6u
#define MSC0_S_PAD4_PIN                 0u
#define MSC0_S_PAD5_PORT                7u
#define MSC0_S_PAD5_PIN                 0u
#define MSC0_S_PAD6_PORT                7u
#define MSC0_S_PAD6_PIN                 1u
#define MSC0_S_PAD7_PORT                1u
#define MSC0_S_PAD7_PIN                 1u
#define MSC0_S_PAD8_PORT                1u
#define MSC0_S_PAD8_PIN                 2u
#define MSC0_S_PAD9_PORT                1u
#define MSC0_S_PAD9_PIN                 3u
#define PASS0_CTB0_OA0_OUT_10X_PORT     1u
#define PASS0_CTB0_OA0_OUT_10X_PIN      2u
#define PASS0_CTB0_OA1_OUT_10X_PORT     1u
#define PASS0_CTB0_OA1_OUT_10X_PIN      3u
#define PASS0_CTB0_PADS0_PORT           1u
#define PASS0_CTB0_PADS0_PIN            0u
#define PASS0_CTB0_PADS1_PORT           1u
#define PASS0_CTB0_PADS1_PIN            1u
#define PASS0_CTB0_PADS2_PORT           1u
#define PASS0_CTB0_PADS2_PIN            2u
#define PASS0_CTB0_PADS3_PORT           1u
#define PASS0_CTB0_PADS3_PIN            3u
#define PASS0_CTB0_PADS4_PORT           1u
#define PASS0_CTB0_PADS4_PIN            4u
#define PASS0_CTB0_PADS5_PORT           1u
#define PASS0_CTB0_PADS5_PIN            5u
#define PASS0_CTB0_PADS6_PORT           1u
#define PASS0_CTB0_PADS6_PIN            6u
#define PASS0_CTB0_PADS7_PORT           1u
#define PASS0_CTB0_PADS7_PIN            7u
#define PASS0_EXPMUX_PADS0_PORT         3u
#define PASS0_EXPMUX_PADS0_PIN          0u
#define PASS0_EXPMUX_PADS1_PORT         3u
#define PASS0_EXPMUX_PADS1_PIN          1u
#define PASS0_EXPMUX_PADS2_PORT         3u
#define PASS0_EXPMUX_PADS2_PIN          2u
#define PASS0_EXPMUX_PADS3_PORT         3u
#define PASS0_EXPMUX_PADS3_PIN          3u
#define PASS0_EXPMUX_PADS4_PORT         3u
#define PASS0_EXPMUX_PADS4_PIN          4u
#define PASS0_EXPMUX_PADS5_PORT         3u
#define PASS0_EXPMUX_PADS5_PIN          5u
#define PASS0_EXPMUX_PADS6_PORT         3u
#define PASS0_EXPMUX_PADS6_PIN          6u
#define PASS0_EXPMUX_PADS7_PORT         3u
#define PASS0_EXPMUX_PADS7_PIN          7u
#define PASS0_SAR_EXT_VREF0_PORT        1u
#define PASS0_SAR_EXT_VREF0_PIN         0u
#define PASS0_SAR_EXT_VREF1_PORT        1u
#define PASS0_SAR_EXT_VREF1_PIN         0u
#define PASS0_SARMUX_PADS0_PORT         5u
#define PASS0_SARMUX_PADS0_PIN          0u
#define PASS0_SARMUX_PADS1_PORT         5u
#define PASS0_SARMUX_PADS1_PIN          1u
#define PASS0_SARMUX_PADS2_PORT         5u
#define PASS0_SARMUX_PADS2_PIN          2u
#define PASS0_SARMUX_PADS3_PORT         5u
#define PASS0_SARMUX_PADS3_PIN          3u
#define PASS0_SARMUX_PADS4_PORT         5u
#define PASS0_SARMUX_PADS4_PIN          4u
#define PASS0_SARMUX_PADS5_PORT         5u
#define PASS0_SARMUX_PADS5_PIN          5u
#define PASS0_SARMUX_PADS6_PORT         5u
#define PASS0_SARMUX_PADS6_PIN          6u
#define PASS0_SARMUX_PADS7_PORT         5u
#define PASS0_SARMUX_PADS7_PIN          7u
#define SRSS_ADFT_POR_PAD_HV_PORT       1u
#define SRSS_ADFT_POR_PAD_HV_PIN        0u

/* HSIOM Connections */
typedef enum
{
    /* Generic HSIOM connections */
    HSIOM_SEL_GPIO                  =  0,       /* SW controlled GPIO. */
    HSIOM_SEL_GPIO_DSI              =  1,       /* SW controlled 'out', DSI controlled 'oe_n'. */
    HSIOM_SEL_DSI_DSI               =  2,       /* DSI controlled 'out' and 'oe_n'. */
    HSIOM_SEL_DSI_GPIO              =  3,       /* DSI controlled 'out', SW controlled 'oe_n'. */
    HSIOM_SEL_CSD_SENSE             =  4,       /* CSD sense connection (analog mode) */
    HSIOM_SEL_CSD_SHIELD            =  5,       /* CSD shield connection (analog mode) */
    HSIOM_SEL_AMUXA                 =  6,       /* AMUXBUS A connection. */
    HSIOM_SEL_AMUXB                 =  7,       /* AMUXBUS B connection. */
    HSIOM_SEL_ACT_0                 =  8,       /* Chip specific Active source 0 connection. */
    HSIOM_SEL_ACT_1                 =  9,       /* Chip specific Active source 1 connection. */
    HSIOM_SEL_ACT_2                 = 10,       /* Chip specific Active source 2 connection. */
    HSIOM_SEL_ACT_3                 = 11,       /* Chip specific Active source 3 connection. */
    HSIOM_SEL_LCD_COM               = 12,       /* LCD common connection. */
    HSIOM_SEL_LCD_SEG               = 13,       /* LCD segment connection. */
    HSIOM_SEL_DS_0                  = 12,       /* Chip specific DeepSleep source 0 connection. */
    HSIOM_SEL_DS_1                  = 13,       /* Chip specific DeepSleep source 1 connection. */
    HSIOM_SEL_DS_2                  = 14,       /* Chip specific DeepSleep source 2 connection. */
    HSIOM_SEL_DS_3                  = 15,       /* Chip specific DeepSleep source 3 connection. */

    /* P0.0 */
    P0_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_0_MSC0_SENSE                 =  4,       /* msc[0].sense:37 */
    P0_0_MSC0_SHIELD                =  5,       /* msc[0].shield:37 */
    P0_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_0_PERI_VIRT_IN_0             =  8,       /* Digital Active - peri.virt_in_0 */
    P0_0_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:0 */
    P0_0_SCB0_UART_RX               = 10,       /* Digital Active - scb[0].uart_rx:0 */
    P0_0_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:0 */
    P0_0_SCB0_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[0].spi_clk:0 */
    P0_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:0 */

    /* P0.1 */
    P0_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_1_MSC0_SENSE                 =  4,       /* msc[0].sense:36 */
    P0_1_MSC0_SHIELD                =  5,       /* msc[0].shield:36 */
    P0_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_1_SRSS_EXT_CLK               =  8,       /* Digital Active - srss.ext_clk */
    P0_1_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:0 */
    P0_1_SCB0_UART_TX               = 10,       /* Digital Active - scb[0].uart_tx:0 */
    P0_1_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:0 */
    P0_1_SCB0_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[0].spi_mosi:0 */
    P0_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:0 */

