zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_64_qfn.h
    /* P3.7 */
    P3_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_7_MSC0_SENSE                 =  4,       /* msc[0].sense:25 */
    P3_7_MSC0_SHIELD                =  5,       /* msc[0].shield:25 */
    P3_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_7_SCB2_UART_RX               = 10,       /* Digital Active - scb[2].uart_rx */
    P3_7_TCPWM_LINE7                = 11,       /* Digital Active - tcpwm.line[7]:0 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_0_MSC0_SENSE                 =  4,       /* msc[0].sense:45 */
    P4_0_MSC0_SHIELD                =  5,       /* msc[0].shield:45 */
    P4_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_0_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:0 */
    P4_0_SCB0_UART_RX               = 10,       /* Digital Active - scb[0].uart_rx:1 */
    P4_0_TCPWM_LINE4                = 11,       /* Digital Active - tcpwm.line[4]:2 */
    P4_0_SCB2_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[2].spi_clk */

    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSC0_SENSE                 =  4,       /* msc[0].sense:44 */
    P4_1_MSC0_SHIELD                =  5,       /* msc[0].shield:44 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:0 */
    P4_1_SCB0_UART_TX               = 10,       /* Digital Active - scb[0].uart_tx:1 */
    P4_1_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:2 */
    P4_1_SCB2_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[2].spi_mosi */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSC0_SENSE                 =  4,       /* msc[0].sense:43 */
    P4_2_MSC0_SHIELD                =  5,       /* msc[0].shield:43 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:0 */
    P4_2_SCB0_UART_RTS              = 10,       /* Digital Active - scb[0].uart_rts:1 */
    P4_2_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:1 */
    P4_2_SCB2_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[2].spi_miso */

    /* P4.3 */
    P4_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_3_MSC0_SENSE                 =  4,       /* msc[0].sense:42 */
    P4_3_MSC0_SHIELD                =  5,       /* msc[0].shield:42 */
    P4_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_3_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:3 */
    P4_3_LIN_LIN_TX0                =  9,       /* Digital Active - lin.lin_tx[0]:3 */
    P4_3_SCB0_UART_CTS              = 10,       /* Digital Active - scb[0].uart_cts:1 */
    P4_3_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:1 */
    P4_3_SCB2_SPI_SELECT0           = 12,       /* Digital Deep Sleep - scb[2].spi_select0 */

    /* P4.4 */
    P4_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_4_MSC0_SENSE                 =  4,       /* msc[0].sense:41 */
    P4_4_MSC0_SHIELD                =  5,       /* msc[0].shield:41 */
    P4_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_4_CXPI_CXPI_TX0              =  8,       /* Digital Active - cxpi.cxpi_tx[0]:3 */
    P4_4_LIN_LIN_RX0                =  9,       /* Digital Active - lin.lin_rx[0]:3 */
    P4_4_PASS0_DSI_SAR_DATA_VALID   = 10,       /* Digital Active - pass[0].dsi_sar_data_valid */
    P4_4_TCPWM_LINE1                = 11,       /* Digital Active - tcpwm.line[1]:1 */
    P4_4_SCB2_SPI_SELECT1           = 12,       /* Digital Deep Sleep - scb[2].spi_select1 */

    /* P4.5 */
    P4_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_5_MSC0_SENSE                 =  4,       /* msc[0].sense:40 */
    P4_5_MSC0_SHIELD                =  5,       /* msc[0].shield:40 */
    P4_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_5_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:3 */
    P4_5_LIN_LIN_EN0                =  9,       /* Digital Active - lin.lin_en[0]:3 */
    P4_5_PASS0_DSI_SAR_SAMPLE_DONE  = 10,       /* Digital Active - pass[0].dsi_sar_sample_done */
    P4_5_TCPWM_LINE_COMPL1          = 11,       /* Digital Active - tcpwm.line_compl[1]:1 */
    P4_5_SCB2_SPI_SELECT2           = 12,       /* Digital Deep Sleep - scb[2].spi_select2 */
    P4_5_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:2 */

    /* P4.6 */
    P4_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_6_MSC0_SENSE                 =  4,       /* msc[0].sense:39 */
    P4_6_MSC0_SHIELD                =  5,       /* msc[0].shield:39 */
    P4_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_6_PASS0_TR_SAR_OUT           = 10,       /* Digital Active - pass[0].tr_sar_out */
    P4_6_TCPWM_LINE2                = 11,       /* Digital Active - tcpwm.line[2]:1 */
    P4_6_SCB2_SPI_SELECT3           = 12,       /* Digital Deep Sleep - scb[2].spi_select3 */
    P4_6_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:2 */

