zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_64_qfn.h
    /* P6.3 */
    P6_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_3_MSC0_SENSE                 =  4,       /* msc[0].sense:26 */
    P6_3_MSC0_SHIELD                =  5,       /* msc[0].shield:26 */
    P6_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_3_SCB2_UART_RTS              = 10,       /* Digital Active - scb[2].uart_rts */
    P6_3_TCPWM_LINE_COMPL6          = 11,       /* Digital Active - tcpwm.line_compl[6]:0 */

    /* P6.4 */
    P6_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_4_MSC0_SENSE                 =  4,       /* msc[0].sense:27 */
    P6_4_MSC0_SHIELD                =  5,       /* msc[0].shield:27 */
    P6_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_4_SCB2_UART_CTS              = 10,       /* Digital Active - scb[2].uart_cts */
    P6_4_TCPWM_LINE6                = 11,       /* Digital Active - tcpwm.line[6]:0 */

    /* P6.5 */
    P6_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_5_MSC0_SENSE                 =  4,       /* msc[0].sense:28 */
    P6_5_MSC0_SHIELD                =  5,       /* msc[0].shield:28 */
    P6_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_5_SCB3_UART_RTS              = 10,       /* Digital Active - scb[3].uart_rts */
    P6_5_SCB2_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[2].i2c_scl */

    /* P6.6 */
    P6_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_6_MSC0_SENSE                 =  4,       /* msc[0].sense:29 */
    P6_6_MSC0_SHIELD                =  5,       /* msc[0].shield:29 */
    P6_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_6_SCB3_UART_CTS              = 10,       /* Digital Active - scb[3].uart_cts */
    P6_6_SCB2_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[2].i2c_sda */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_MSC0_SENSE                 =  4,       /* msc[0].sense:0 */
    P7_0_MSC0_SHIELD                =  5,       /* msc[0].shield:0 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_PASS0_DSI_CTB_CMP0         = 13,       /* Digital Deep Sleep - pass[0].dsi_ctb_cmp0 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_MSC0_SENSE                 =  4,       /* msc[0].sense:1 */
    P7_1_MSC0_SHIELD                =  5,       /* msc[0].shield:1 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_PASS0_DSI_CTB_CMP1         = 13        /* Digital Deep Sleep - pass[0].dsi_ctb_cmp1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4HVMS128K_64_QFN_H_ */


/* [] END OF FILE */
